Customization.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-05-10 dim. 14:01 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Customization</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Firmin Martin">
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">Customization</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgbc91f23">1. General settings</a></li>
<li><a href="#org6ed0f83">2. Version control settings</a></li>
<li><a href="#org124e66b">3. Python webserver settings</a></li>
<li><a href="#orgcfb5288">4. Async export settings</a></li>
<li><a href="#org715e175">5. Backup settings</a></li>
</ul>
</div>
</nav>
<p>
<code>org-glaux</code> can be customized under the group <code>tools/org-glaux</code>. 
</p>

<div id="outline-container-orgbc91f23" class="outline-2">
<h2 id="orgbc91f23"><span class="section-number-2">1</span> General settings</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>List of org-glaux root directories.</li>
</ul>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> org-glaux-location-list '(<span class="org-string">"~/org/wiki"</span>))
</pre>
</div>

<ul class="org-ul">
<li>If this variable is non-nil all org-glaux pages will be read-only by default.</li>
</ul>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> org-glaux-default-read-only nil)
</pre>
</div>

<ul class="org-ul">
<li>If set, all org-glaux pages are closed when root directory is switched.</li>
</ul>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> org-glaux-close-root-switch t)
</pre>
</div>

<p>
Default template used to create org-glaux pages/files.
</p>
<ul class="org-ul">
<li>%n - is replaced by the page name.</li>
<li>%d - is replaced by current date in the format year-month-day.</li>
</ul>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> org-glaux-template
  (string-trim
   <span class="org-string">"</span>
<span class="org-string">#+OPTIONS: d:nil tags:nil todo:nil toc:t ^:nil</span>
<span class="org-string">#+TITLE: %n</span>
<span class="org-string">#+DESCRIPTION:</span>
<span class="org-string">#+KEYWORDS:</span>
<span class="org-string">#+STARTUP:  overview</span>
<span class="org-string">#+DATE: %d</span>
<span class="org-string">#+BIBLIOGRAPHY: main plain</span>
<span class="org-string">"</span>)
</pre>
</div>

<ul class="org-ul">
<li>Default index page (index.org) accessed with <code>M-x org-glaux-index</code></li>
</ul>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> org-glaux-index-file-basename <span class="org-string">"index"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org6ed0f83" class="outline-2">
<h2 id="org6ed0f83"><span class="section-number-2">2</span> Version control settings</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Activate edit history using version control software (VCS)
<ul class="org-ul">
<li><code>'git</code>: for git support</li>
<li><code>nil</code>: no version control</li>
</ul></li>
</ul>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> org-glaux-vc-backend 'git)
</pre>
</div>

<ul class="org-ul">
<li>Do not register file having size exceeding an amount of bytes.</li>
</ul>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> org-glaux-vc-ignore-files-exceed-size (* 150 1024 1024))
</pre>
</div>


<ul class="org-ul">
<li>List of glob patterns to exclude directories from version control.</li>
</ul>
<p>
These ignored-patterns apply on every wiki and have effect only if
`org-glaux-vc-wiki-pages-only' is nil.  To specify a per-wiki or
per-directory files pattern to ignore, include them in a local `.gitignore'
instead.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> org-glaux-vc-ignored-dirs-glob
  (append '(<span class="org-string">"*ltximg*"</span> <span class="org-string">"*_minted*"</span>)
          (mapcar (<span class="org-keyword">lambda</span> (d) (format <span class="org-string">"*%s*"</span> d)) vc-directory-exclusion-list)))
</pre>
</div>

<ul class="org-ul">
<li>These ignored-patterns apply on every wiki and have effect only if</li>
</ul>
<p>
`org-glaux-vc-wiki-pages-only' is nil.  To specify a per-wiki or
per-directory files pattern to ignore, include them in a local `.gitignore'
instead. List of glob patterns to exclude file-path from version control.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> org-glaux-vc-ignored-files-glob '(<span class="org-string">"*.html"</span> <span class="org-string">"*.bbl"</span> <span class="org-string">"*.tex"</span> <span class="org-string">"*~"</span> <span class="org-string">"*#*?#"</span>))
</pre>
</div>

<ul class="org-ul">
<li>If non-nil, the version control applies only on wiki pages (.org files).</li>
</ul>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> org-glaux-vc-wiki-pages-only nil)
</pre>
</div>

<ul class="org-ul">
<li>"Indicate when files are registered in version control and committed."
<ul class="org-ul">
<li><code>'close</code> : commit opened wiki buffers when `org-glaux-close-pages' is called</li>
<li><code>'follow</code> : commit when follow a wiki page</li>
<li><code>'manual</code> : always commit manually</li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> org-glaux-vc-commit-when 'close)
</pre>
</div>
</div>
</div>

<div id="outline-container-org124e66b" class="outline-2">
<h2 id="org124e66b"><span class="section-number-2">3</span> Python webserver settings</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Default port to server org-glaux static files server.</li>
</ul>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> org-glaux-server-port <span class="org-string">"8000"</span>)
</pre>
</div>

<ul class="org-ul">
<li>Default address that the server listens to.</li>
</ul>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> org-glaux-server-host <span class="org-string">"0.0.0.0"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcfb5288" class="outline-2">
<h2 id="orgcfb5288"><span class="section-number-2">4</span> Async export settings</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Additional options passed to `org-publish'.</li>
</ul>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> org-glaux-publish-plist '())
</pre>
</div>
</div>
</div>

<div id="outline-container-org715e175" class="outline-2">
<h2 id="org715e175"><span class="section-number-2">5</span> Backup settings</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>Path to backup directory.</li>
</ul>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> org-glaux-backup-location nil)
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
